/* Freight Calculation Sample
DEFINE DATA
PARAMETER USING TARIFF-P
LOCAL
  1 #BASE-CHARGE (P9.2)
  1 #SURCHARGE (P7.2)
END-DEFINE

FIND (1) TARIFF-VIEW WITH CLASS = #SHIP-CLASS
  #BASE-CHARGE := RATE * #SHIP-WEIGHT
  IF #SHIP-WEIGHT > WEIGHT-LIMIT
    #SURCHARGE := HEAVY-SURCHARGE
    ESCAPE BOTTOM
  END-IF
END-FIND
END
